AstGeomPolyline3d.createFromVerticesAndFilletInformation(AstArray&lt;AstGeomPoint3d,AstArrayMemCopyReallocator&lt;AstGeomPoint3d&gt;,AstArrayMemoryController&lt;AstGeomPoint3d&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AstArray&lt;System.Double,AstArrayMemCopyReallocator&lt;System.Double&gt;,AstArrayMemoryController&lt;System.Double&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AstGeomVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean,System.Boolean,System.Double,System.Boolean,System.Boolean)
Creates an augmented polygon
Precondition: plg.length() == filletRadia.length()
plgNormal is the normal of the plg
Positive radia indicates a fillet at convex vertices
Negative radia indicates a fillet at concav vertices
Zero-Radia indicates non filleted vertices
Postcondition:
An open polygone is created, where filleted corners are split up into two
new corners. One of these new corners contains the corner feature information.
For convex fillets plgNormal is used.
For concav fillets -plgNormal is used.